uhnp/src/Catalogs/тн_ИдентификационныеКодыЗакупок/тн_ИдентификационныеКодыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ИдентификационныеКодыЗакупок</name>
  <comment>//Ведутенко С.А. от 13.12.2023 Выполнение задач №000047803</comment>
  <attributes>
    <name>ГодЗакупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификационныйКодЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйНомерЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/тн_ИдентификационныеКодыЗакупок/Forms/ФормаЭлементаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Объект.ГодЗакупки = Год(ТекущаяДатаСеанса());		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		СформироватьИКЗ();		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда		
		СформироватьИКЗ();			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьУникальностьИКЗ(Отказ);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодЗакупкиПриИзменении(Элемент)
	
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификационныйКодЗаказчикаПриИзменении(Элемент)
	
	ДополнитьОбъектЗначениемНулем(Объект.ИдентификационныйКодЗаказчика);
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЗакупкиПриИзменении(Элемент)
	
	ДополнитьОбъектЗначениемНулем(Объект.НомерЗакупки);
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйНомерЗакупкиПриИзменении(Элемент)
	
	ДополнитьОбъектЗначениемНулем(Объект.ДополнительныйНомерЗакупки);
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКПД2ПриИзменении(Элемент)
	
	ДополнитьОбъектЗначениемНулем(Объект.КодОКПД2);
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаРасходовПриИзменении(Элемент)
	
	ДополнитьОбъектЗначениемНулем(Объект.КодВидаРасходов);
	СформироватьИКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьРасшифровкуИКЗ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьИКЗ()
	
	РевизитыИКЗ = Новый Массив;
	РевизитыИКЗ.Добавить(Прав(Строка(Объект.ГодЗакупки), 2));
	РевизитыИКЗ.Добавить(Объект.ИдентификационныйКодЗаказчика);
	РевизитыИКЗ.Добавить(Объект.НомерЗакупки);
	РевизитыИКЗ.Добавить(Объект.ДополнительныйНомерЗакупки);
	РевизитыИКЗ.Добавить(Объект.КодОКПД2);
	РевизитыИКЗ.Добавить(Объект.КодВидаРасходов);
	
	Объект.Наименование = СтрСоединить(РевизитыИКЗ, "");	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОбъектЗначениемНулем(ИзменяемыйОбъект)
	
	ИзменяемыйОбъект = СтрЗаменить(ИзменяемыйОбъект, " ", "0");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуИКЗ()
	
	ДополнитьОбъектЗначениемНулем(Объект.Наименование);
	
	Объект.ГодЗакупки = Число("20" + Сред(Объект.Наименование, 1, 2));
	Объект.ИдентификационныйКодЗаказчика = Сред(Объект.Наименование, 3, 20);
	Объект.НомерЗакупки = Сред(Объект.Наименование, 23, 4);
	Объект.ДополнительныйНомерЗакупки = Сред(Объект.Наименование, 27, 3);
	Объект.КодОКПД2 = Сред(Объект.Наименование, 30, 4);
	Объект.КодВидаРасходов = Сред(Объект.Наименование, 34, 3);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИКЗ(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИдентификационныеКодыЗакупок.Код КАК Код
	               |ИЗ
	               |	Справочник.тн_ИдентификационныеКодыЗакупок КАК ИдентификационныеКодыЗакупок
	               |ГДЕ
	               |	НЕ ИдентификационныеКодыЗакупок.Ссылка = &ТекущийИКЗ
	               |	И ИдентификационныеКодыЗакупок.Наименование = &ИКЗ";
	
	Запрос.УстановитьПараметр("ТекущийИКЗ", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИКЗ", Объект.Наименование);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ТекстСообщения = "Идентификационный код закупки """ + Объект.Наименование + """ уже добавлен: код элемента справочника " + Выборка.Код;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
